src/cf/src/InformationRegisters/РазрешениеНаРедактированиеДокументов/РазрешениеНаРедактированиеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазрешениеНаРедактированиеДокументов</name>
  <comment>Разовое разрешение пользователю отредактировать документ в закрытом периоде; гаснет после записи документа</comment>
  <resources>
    <name>КтоРазрешил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРазрешения</name>
    <type>
      <types>DateTime</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИспользования</name>
    <type>
      <types>DateTime</types>
    </type>
  </resources>
  <resources>
    <name>Разрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>РедактируемыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/РазрешениеНаРедактированиеДокументов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Есть ли у текущего пользователя действующее разрешение на редактирование документа в закрытом периоде.
//
// Параметры:
//  Документ - ДокументСсылка - редактируемый документ.
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьРазрешение(Документ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Разрешения.Разрешено КАК Разрешено
	                      |ИЗ
	                      |	РегистрСведений.РазрешениеНаРедактированиеДокументов КАК Разрешения
	                      |ГДЕ
	                      |	Разрешения.РедактируемыйДокумент = &Документ
	                      |	И Разрешения.Пользователь = &Пользователь
	                      |	И Разрешения.Разрешено");
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

// Гасит разрешение текущего пользователя на документ после использования.
//
// Параметры:
//  Документ - ДокументСсылка - записанный документ.
//
Процедура ПогаситьРазрешение(Документ) Экспорт
	МенеджерЗаписи = РегистрыСведений.РазрешениеНаРедактированиеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.РедактируемыйДокумент = Документ;
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.Пользователь;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Или Не МенеджерЗаписи.Разрешено Тогда
		Возврат;
	КонецЕсли;
	МенеджерЗаписи.Разрешено = Ложь;
	МенеджерЗаписи.ДатаИспользования = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать();
КонецПроцедуры

#КонецОбласти
